Tekla Open API Reference for Tekla Structures 2025
Load.BoundingBoxDz Property
 The dimension of the bounding box in the Z direction.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double BoundingBoxDz { get; set; }
Public Property BoundingBoxDz As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Load Class
Tekla.Structures.Model Namespace